<?php
// 所有assert都可以放到这里

return [
    // 1. field_map相关
    'status_name' => '状态',
    'department_status' => '部门状态',
    'status_0' => '停用',
    'status_1' => '启用',

    // 部门类型
    'department_type_name' => '部门类型',
    'job_type_presale' => '售前',
    'job_type_aftersale' => '售后',
    'distribute_type' => '分单方式',
    'manual' => '手动',
    'automatic' => '自动',

    // 2. 岗位类型
    'level_type' => '岗位类型',
    'Supervisor' => '主管',
    'Staff' => '员工',

    // 3. 订单相关
    '无效' => '无效',
    '有效' => '有效',
    '手工单状态' => '手工单状态',         // name 可以不用翻译，@2020.6.2找前端确认过，他们不用name，只需要翻译enum中的值
    '未提交' => '未提交',
    '已提交' => '已提交',
    '已取消' => '已取消',
    '未处理' => '未处理',
    '已处理' => '已处理',

    '已归档' => '已归档',
    '成功' => '成功',
    '失败' => '失败',
    '验证中' => '验证中',
    '已分配' => '已分配',
    '未分配' => '未分配',

    '系统判重' => '系统判重',
    '审核取消' => '审核取消',
    '审核重复' => '审核重复',

    '网盟' => '网盟',
    '分销' => '分销',

    '广告' => '广告',
    '售前手工' => '售前手工',
    '售后手工' => '售后手工',

    '常规订单' => '常规订单',
    '补发订单' => '补发订单',
    '重发订单' => '重发订单',
    '线索订单' => '线索订单',
    '异常重发订单' => '异常重发订单',

    '内部单' => '内部单',
    '外部单' => '外部单',

    '待审核' => '待审核',
    '已审核' => '已审核',
    '已驳回' => '已驳回',

    '提交' => '提交',
    '保存' => '保存',
    '咨询' => '咨询',
    '复购' => '复购',

    '已呼出' => '已呼出',
    '未呼出' => '未呼出',

    '未成交' => '未成交',
    '已成交' => '已成交',

    '新客户' => '新客户',
    '复购客户' => '复购客户',
    '高签收客户' => '高签收客户',
    '高拒收客户' => '高拒收客户',
    '客户等级' => '客户等级',

    '单值标签' => '单值标签',
    '多值标签' => '多值标签',

    '满数量折扣' => '满数量折扣',
    '可叠加' => '可叠加',
    '不叠加' => '不叠加',
    '所有商品' => '所有商品',
    '单个商品' => '单个商品',
    '全部商品' => '全部商品',
    '部分商品' => '部分商品',
    'none' => '无',
    'has_replenish' => '已补发',
    'has_redelivery' => '已重发',
    'has_abnormal_redelivery' => '已异常重发',
];
